docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-10 Tue 14:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Statistical Models 2023</title>
<meta name="author" content="Dale Barr" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Statistical Models 2023</h1>

<div id="outline-container-orgdc2ecc9" class="outline-2">
<h2 id="orgdc2ecc9">Course description</h2>
<div class="outline-text-2" id="text-orgdc2ecc9">
<p>
In this course, students will learn about planning, conducting, and analysing psychological experiments using the R statistical programming environment. The focus is on developing programming and analysis skills that will enable a transparent and reproducible analysis workflow. 
</p>
</div>

<div id="outline-container-org5ced834" class="outline-3">
<h3 id="org5ced834">Aims</h3>
<div class="outline-text-3" id="text-org5ced834">
<ul class="org-ul">
<li>To provide an understanding of the basic statistics appropriate to the analysis of Psychological experiments.</li>
<li>To learn how to produce reproducible scripts and reports using R and RMarkdown</li>
</ul>
</div>
</div>

<div id="outline-container-orge86c8f9" class="outline-3">
<h3 id="orge86c8f9">Intended Learning Outcomes</h3>
<div class="outline-text-3" id="text-orge86c8f9">
<p>
By the end of this course students will be able to:
</p>

<ul class="org-ul">
<li>Integrate knowledge about study design and statistics to formulate and estimate the General Linear Model (GLM) appropriate to the various types of study designs encountered in psychology, especially studies with repeated observations.</li>
<li>Visualise and interpret various effects (including interactions) in multi-way designs.</li>
<li>Estimate linear mixed-effects models and describe their relation to traditional techniques such as ANOVA and multiple regression.</li>
<li>Perform logistic regression and explain and interpret the statistical output.</li>
<li>Create reproducible data analysis scripts and reports within the R statistical programming environment.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org13d8391" class="outline-2">
<h2 id="org13d8391">Textbook</h2>
<div class="outline-text-2" id="text-org13d8391">
<p>
Barr, Dale J. (2023). <i>Learning statistical models through simulation in R: An interactive textbook.</i> Version 1.1-1. Retrieved from <a href="https://psyteachr.github.io/stat-models">https://psyteachr.github.io/stat-models</a>.
</p>
</div>
</div>

<div id="outline-container-org65caa6f" class="outline-2">
<h2 id="org65caa6f">Schedule</h2>
<div class="outline-text-2" id="text-org65caa6f">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Week</th>
<th scope="col" class="org-left">Date</th>
<th scope="col" class="org-right">Time</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Slides</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Th Sep 21</td>
<td class="org-right">14:00-15:00</td>
<td class="org-left">The General Linear Model</td>
<td class="org-left"><a href="slides/01_introduction/index.html">html</a> <a href="slides/01_introduction/01_introduction.pdf">pdf</a></td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Th Sep 28</td>
<td class="org-right">14:00-15:00</td>
<td class="org-left">Correlation and Regression</td>
<td class="org-left"><a href="slides/02_correlation/index.html">html</a> <a href="slides/02_correlation/02_correlation.pdf">pdf</a></td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Th Oct 05</td>
<td class="org-right">14:00-15:00</td>
<td class="org-left">Multiple Regression</td>
<td class="org-left"><a href="slides/03_multiple-regression/index.html">html</a> <a href="slides/03_multiple-regression/03_multiple-regression.pdf">pdf</a></td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Th Oct 12</td>
<td class="org-right">14:00-15:00</td>
<td class="org-left">Interactions</td>
<td class="org-left"><a href="slides/04_interactions/index.html">html</a> <a href="slides/04_interactions/04_interactions.pdf">pdf</a></td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Th Oct 19</td>
<td class="org-right">14:00-15:00</td>
<td class="org-left">Linear mixed-effects modeling 1</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">---</td>
<td class="org-right">---</td>
<td class="org-left"><b>READING WEEK</b></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Th Nov 02</td>
<td class="org-right">14:00-15:00</td>
<td class="org-left">Linear mixed-effects modeling 2</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">Th Nov 09</td>
<td class="org-right">14:00-15:00</td>
<td class="org-left">Linear mixed-effects modeling 3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">Th Nov 16</td>
<td class="org-right">14:00-15:00</td>
<td class="org-left">Generalized Linear Models</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Th Nov 23</td>
<td class="org-right">14:00-15:00</td>
<td class="org-left">Wrap Up</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org5bd6720" class="outline-2">
<h2 id="org5bd6720">Assessment</h2>
<div class="outline-text-2" id="text-org5bd6720">
</div>
<div id="outline-container-org7354cc5" class="outline-3">
<h3 id="org7354cc5">Weekly formative assessment</h3>
<div class="outline-text-3" id="text-org7354cc5">
<p>
Each week you will be assigned formative coursework that will allow you to build your data analysis skills. This coursework is not assessed, but you will receive feedback in the form of problem solutions. You are encouraged to attend an online review session each Tuesday from 10-11am, where you can see a walkthrough and ask questions (see the course Moodle page for the link).
</p>
</div>
</div>

<div id="outline-container-org0de4acc" class="outline-3">
<h3 id="org0de4acc">Final exam</h3>
<div class="outline-text-3" id="text-org0de4acc">
<p>
Your final grade for the course is based on your final exam. See the Moodle page for information on the format of the assessment.
</p>
</div>
</div>
</div>

<div id="outline-container-org8e823a7" class="outline-2">
<h2 id="org8e823a7">Getting help</h2>
<div class="outline-text-2" id="text-org8e823a7">
<p>
If you have a question about course content, please ask it on the course channel on Microsoft Teams, so that others may benefit. Otherwise, contact me by email or visit me during my office hours, Tuesdays 15:30-17:00 local UK time.
</p>

<p>
For other contact information, please consult the <a href="https://moodle.gla.ac.uk/course/view.php?id=37390">course page on Moodle</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Dale Barr</p>
<p class="date">Created: 2023-10-10 Tue 14:08</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>